karthiknataraj547/Water-pump-controller/firmware/arduino_ide/ESP32_Main_Gateway/ESP32_Main_Gateway.ino
/*
 * ==============================================================================
 * HydroPulse IoT Water Pump Controller & Gateway - ESP32 Main Node Firmware
 * ==============================================================================
 * Architecture: ESP32 FreeRTOS Dual-Core System
 * Core 0: TaskNetwork (Wi-Fi, MQTT with LWT, HTTP Backend API, Status Heartbeat)
 * Core 1: TaskControl (Relay Soft-Start, Manual Switching, Safety Interlocks, Reset)
 *
 * Hardware Peripherals:
 *   - Relay Module (Active HIGH)               -> GPIO 23
 *   - Manual Push Button (Active LOW)          -> GPIO 19
 *   - Emergency Stop Switch (Active LOW)       -> GPIO 18
 *   - Factory Hard Reset Button (BOOT / GPIO 0)-> GPIO 0  (Hold 1.2s at boot / 1.5s runtime)
 *   - Blue Network Status LED                  -> GPIO 2
 *   - Green Pump Running LED                   -> GPIO 4
 *   - Alert Buzzer                             -> GPIO 5
 *
 * Communications:
 *   - BLE GATT Provisioning (UUIDs aligned with Flutter Mobile App)
 *   - Wi-Fi Station with persistent auto-reconnect & max RF transmit power
 *   - Global Cloud MQTT Broker with Last Will & Testament (LWT) on 'pump/status'
 *   - ESP-NOW Central Hub receiving telemetry from ESP8266 Sub Node (CRC16 check)
 *   - Backend HTTP API Telemetry Posting (REST failover / sync)
 *
 * Required Libraries (Install via Arduino Library Manager):
 *   1. "PubSubClient" by Nick O'Leary (v2.8+)
 *   2. "ArduinoJson" by Benoit Blanchon (v6.x or v7.x)
 *   (BLE and ESP-NOW are built into the ESP32 board package automatically)
 * ==============================================================================
 */

#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_idf_version.h>
#if __has_include(<esp_mac.h>)
#include <esp_mac.h>
#endif
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <HTTPClient.h>
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"

// Built-in ESP32 BLE Stack
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>

// ==============================================================================
// 1. HARDWARE PIN DEFINITIONS & CONSTANTS
// ==============================================================================
#define PIN_RELAY_PUMP         23   // Main Pump Relay Pin (GPIO 23)
#define RELAY_ACTIVE_LOW       false// Set to 'true' for Active-LOW relay modules, 'false' for Active-HIGH
#define PIN_MANUAL_BUTTON      19   // Manual toggle push button (Active LOW with pullup)
#define PIN_EMERGENCY_STOP     18   // Emergency cutoff switch (Active LOW with pullup)
#define PIN_HARD_RESET         0    // Factory Hard Reset button (BOOT Button / GPIO 0)
#define PIN_LED_NETWORK        2    // Blue network LED (Blinks when offline, solid when connected)
#define PIN_LED_PUMP           4    // Green pump running LED
#define PIN_BUZZER             5    // Piezo alert buzzer

#define FIRMWARE_VERSION       "2.0.10"
#define DEFAULT_DEVICE_PREFIX  "esp32_pump_"
#define BLE_DEVICE_PREFIX      "PumpController-"
#define NVS_NAMESPACE          "pump_config"

// Networking & Cloud Defaults
#define DEFAULT_MQTT_BROKER    "broker.emqx.io"
#define DEFAULT_MQTT_PORT      1883
#define STATUS_REPORT_INTERVAL 1000     // 1 second dedicated Main Node heartbeat
#define SUB_NODE_TIMEOUT_MS    2000     // 2s timeout for 150ms ESP8266 Sub Node streaming (fast failover)
#define MAX_RUN_TIME_LIMIT_MS  1800000  // 30 minutes continuous max runtime safety limit
#define BACKEND_API_URL        "https://water-pump-controller.vercel.app/api/v1/telemetry" // Centralized Cloud API endpoint

// BLE Provisioning UUIDs (Matching Flutter App)
#define SERVICE_UUID_PROV      "19B10000-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_WIFI_SSID    "19B10001-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_WIFI_PASS    "19B10002-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_AUTH_TOKEN   "19B10003-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_PROV_STATUS  "19B10004-E8F2-537E-4F6C-D104768A1214"
#define CHAR_UUID_DEVICE_INFO  "19B10005-E8F2-537E-4F6C-D104768A1214"

// ==============================================================================
// 2. BINARY TELEMETRY PACKET (ESP-NOW PROTOCOL)
// ==============================================================================
#pragma pack(push, 1)
struct SensorTelemetryPacket {
  uint16_t header;        // 0xAA55
  char     nodeId[16];    // e.g. "tank_node_001"
  uint32_t sequence;      // Incrementing counter
  float    waterLevelPct; // 0.0 - 100.0%
  float    waterVolumeL;  // Liters
  float    flowRateLpm;   // Liters / minute
  float    waterTempC;    // Degrees C
  float    tdsPpm;        // Total Dissolved Solids
  float    batteryVoltage;// Volts (3.7V - 4.2V)
  uint8_t  nodeStatus;    // 0: OK, 1: Low Battery, 2: Sensor Error
  uint16_t checksum;      // CRC16-CCITT
};
#pragma pack(pop)

// ==============================================================================
// 3. GLOBAL OBJECTS & RUNTIME STATE
// ==============================================================================
Preferences prefs;
WiFiClient espClient;
PubSubClient mqttClient(espClient);

BLEServer*         pBleServer = nullptr;
BLECharacteristic* pStatusChar = nullptr;
bool               bleClientConnected = false;
bool               bleProvisioningActive = false;

String deviceId = "";
String storedSSID = "";
String storedPass = "";
String storedBackendUrl = BACKEND_API_URL;
String incomingSsid = "";
String incomingPass = "";
String incomingToken = "";

// Operational Modes: AUTO (autonomous levels), MANUAL (app/button direct), SCHEDULE
String systemMode = "AUTO";
float autoStartLevel = 25.0f;
float autoStopLevel = 95.0f;
bool dryRunProtectionEnabled = true;

// State variables
bool pumpRunning = false;
bool emergencyStopped = false;
unsigned long pumpStartTime = 0;

// Non-blocking Command Queue & Status Notification Flags
volatile bool requestedPumpState = false;
volatile bool hasPendingPumpCommand = false;
String pendingCmdReason = "";
String pendingCmdId = "";
volatile bool notifyMqttStatusUpdate = false;

// Sub node telemetry cache (-1 sentinel = no sensor data yet)
float currentLevelPct = -1.0f;
float currentVolumeL = 0.0f;
float currentFlowRateLpm = 0.0f;
float currentTempC = 0.0f;
float currentTdsPpm = 0.0f;
float currentBatteryV = 0.0f;
uint32_t lastPacketSeq = 0;
unsigned long lastSensorPacketTime = 0;

// FreeRTOS Task Handles
TaskHandle_t TaskNetworkHandle = NULL;
TaskHandle_t TaskControlHandle = NULL;

