karthiknataraj547/Water-pump-controller/firmware/arduino_ide/ESP32_Main_Gateway/ESP32_Main_Gateway.ino
// Cloud Broker Failover Pool (Prioritizing EMQX Cloud MQTT broker for low-latency synchronized communication)
const char* CLOUD_BROKERS[] = {"broker.emqx.io", "broker.hivemq.com", "test.mosquitto.org"};
int currentBrokerIdx = 0;
unsigned long lastMqttRetry = 0;

// Forward Declarations
void updateBleStatus(const String &state, const String &ip = "", const String &error = "");
bool connectWifi(const String &ssid, const String &pass);
void setPumpState(bool state, const String &reason);
void executeFactoryReset();
void sendHttpBackendTelemetry();
uint16_t calculateCRC16(const uint8_t *data, size_t len);

// ==============================================================================
// 4. CRC16-CCITT CHECKSUM CALCULATION
// ==============================================================================
uint16_t calculateCRC16(const uint8_t *data, size_t len) {
  uint16_t crc = 0xFFFF;
  for (size_t i = 0; i < len; i++) {
    crc ^= (uint16_t)data[i] << 8;
    for (uint8_t j = 0; j < 8; j++) {
      if (crc & 0x8000) crc = (crc << 1) ^ 0x1021;
      else crc <<= 1;
    }
  }
  return crc;
}

// ==============================================================================
// 5. BLE PROVISIONING ENGINE
// ==============================================================================
class MyServerCallbacks: public BLEServerCallbacks {
  void onConnect(BLEServer* pServer) {
    bleClientConnected = true;
    Serial.println("[BLE] Central smartphone connected!");
    updateBleStatus("CONNECTED_BLE");
  }

  void onDisconnect(BLEServer* pServer) {
    bleClientConnected = false;
    Serial.println("[BLE] Central smartphone disconnected.");
    if (bleProvisioningActive) {
      BLEDevice::startAdvertising();
    }
  }
};

volatile bool pendingWifiProvisioning = false;

class SsidCharCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pChar) {
    String val = pChar->getValue().c_str();
    if (val.length() > 0) {
      incomingSsid = val;
      Serial.printf("\n[BLE RX] >>> Wi-Fi SSID received: '%s'\n", incomingSsid.c_str());
    }
  }
};

class PassCharCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pChar) {
    String val = pChar->getValue().c_str();
    incomingPass = val;
    Serial.printf("[BLE RX] >>> Wi-Fi Password received (%d characters).\n", incomingPass.length());
  }
};

class TokenCharCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pChar) {
    String val = pChar->getValue().c_str();
    if (val.length() > 0) {
      incomingToken = val;
      Serial.printf("[BLE RX] >>> Auth/Claim Token received: '%s'\n", incomingToken.c_str());
      
      // Trigger asynchronous connection in TaskNetwork
      if (incomingSsid.length() > 0) {
        updateBleStatus("CONNECTING_WIFI");
        pendingWifiProvisioning = true;
      }
    }
  }
};

void updateBleStatus(const String &state, const String &ip, const String &error) {
  if (!pStatusChar) return;
  StaticJsonDocument<256> doc;
  doc["state"] = state;
  doc["ip_address"] = ip;
  doc["mac_address"] = WiFi.macAddress();
  doc["device_id"] = deviceId;
  if (error.length() > 0) doc["error_message"] = error;

  String json;
  serializeJson(doc, json);
  pStatusChar->setValue(json.c_str());
  pStatusChar->notify();
  Serial.printf("[BLE Notify] %s\n", json.c_str());
}

void startBleProvisioning() {
  if (bleProvisioningActive) return;

  String advName = String(BLE_DEVICE_PREFIX) + deviceId.substring(11);
  BLEDevice::init(advName.c_str());
  BLEDevice::setPower(ESP_PWR_LVL_P9);

  pBleServer = BLEDevice::createServer();
  pBleServer->setCallbacks(new MyServerCallbacks());

  BLEService *pService = pBleServer->createService(SERVICE_UUID_PROV);

  // SSID Characteristic (Write)
  BLECharacteristic *pSsid = pService->createCharacteristic(
    CHAR_UUID_WIFI_SSID,
    BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR
  );
  pSsid->setCallbacks(new SsidCharCallbacks());

  // Password Characteristic (Write)
  BLECharacteristic *pPass = pService->createCharacteristic(
    CHAR_UUID_WIFI_PASS,
    BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR
  );
  pPass->setCallbacks(new PassCharCallbacks());

  // Auth Token Characteristic (Write)
  BLECharacteristic *pToken = pService->createCharacteristic(
    CHAR_UUID_AUTH_TOKEN,
    BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR
  );
  pToken->setCallbacks(new TokenCharCallbacks());

  // Status Notification Characteristic (Read | Notify)
  pStatusChar = pService->createCharacteristic(
    CHAR_UUID_PROV_STATUS,
    BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_NOTIFY
  );
  pStatusChar->addDescriptor(new BLE2902());

  // Device Info Characteristic (Read)
  BLECharacteristic *pInfo = pService->createCharacteristic(
    CHAR_UUID_DEVICE_INFO,
    BLECharacteristic::PROPERTY_READ
  );
  StaticJsonDocument<256> infoDoc;
  infoDoc["device_id"] = deviceId;
  infoDoc["mac"] = WiFi.macAddress();
  infoDoc["fw_version"] = FIRMWARE_VERSION;
  String infoStr;
  serializeJson(infoDoc, infoStr);
  pInfo->setValue(infoStr.c_str());

  pService->start();

  BLEAdvertising *pAdv = BLEDevice::getAdvertising();
  pAdv->addServiceUUID(SERVICE_UUID_PROV);
  pAdv->setScanResponse(true);
  pAdv->setMinPreferred(0x06);
  pAdv->setMinPreferred(0x12);
  BLEDevice::startAdvertising();

  bleProvisioningActive = true;
  Serial.printf("[BLE] Provisioning Server active as '%s'\n", advName.c_str());
}

void stopBleProvisioning() {
  if (!bleProvisioningActive) return;
  Serial.println("[BLE] Wi-Fi is connected. Deactivating BLE server to save power and RF bandwidth.");
  BLEDevice::getAdvertising()->stop();
  BLEDevice::deinit(false);
  pStatusChar = nullptr;
  pBleServer = nullptr;
  bleProvisioningActive = false;
  Serial.println("[BLE] BLE Stack cleanly stopped.");
}

// ==============================================================================
// 6. WI-FI & RF RADIO MANAGER
// ==============================================================================
bool connectWifi(const String &ssid, const String &pass) {
  Serial.printf("[WiFi] Connecting to SSID: '%s'...\n", ssid.c_str());

  WiFi.persistent(true);
  WiFi.setAutoReconnect(true);
  WiFi.setTxPower(WIFI_POWER_19_5dBm); // Maximum RF transmit power for wall penetration
  WiFi.disconnect(false);
  delay(100);

  WiFi.begin(ssid.c_str(), pass.c_str());

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(250);
    digitalWrite(PIN_LED_NETWORK, !digitalRead(PIN_LED_NETWORK));
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("[WiFi] Connected! IP: %s | RSSI: %d dBm | Channel: %d\n", 
                  WiFi.localIP().toString().c_str(), WiFi.RSSI(), WiFi.channel());
    digitalWrite(PIN_LED_NETWORK, HIGH);

    // Disable modem power saving on radio after connection
    WiFi.setSleep(false);
    esp_wifi_set_ps(WIFI_PS_NONE);

