karthiknataraj547/Water-pump-controller/firmware/arduino_ide/ESP32_Main_Gateway/ESP32_Main_Gateway.ino
    // Refresh device ID from verified live MAC if previously uninitialized
    if (deviceId.endsWith("000000") || deviceId.length() == 0) {
      uint8_t liveMac[6] = {0};
      WiFi.macAddress(liveMac);
      if (liveMac[3] == 0 && liveMac[4] == 0 && liveMac[5] == 0) {
        uint64_t chipMac = ESP.getEfuseMac();
        uint8_t* efuseBytes = (uint8_t*)(&chipMac);
        for (int i = 0; i < 6; i++) liveMac[i] = efuseBytes[i];
      }
      if (!(liveMac[3] == 0 && liveMac[4] == 0 && liveMac[5] == 0)) {
        char devIdBuf[32];
        snprintf(devIdBuf, sizeof(devIdBuf), "%s%02X%02X%02X", DEFAULT_DEVICE_PREFIX, liveMac[3], liveMac[4], liveMac[5]);
        deviceId = String(devIdBuf);
        Serial.printf("[SYSTEM] Device ID updated from hardware MAC: %s\n", deviceId.c_str());
      }
    }

    // Save to Flash NVS
    prefs.begin(NVS_NAMESPACE, false);
    prefs.putString("wifi_ssid", ssid);
    prefs.putString("wifi_pass", pass);
    prefs.end();
    storedSSID = ssid;
    storedPass = pass;

    return true;
  } else {
    Serial.println("[WiFi] Connection failed or timed out.");
    digitalWrite(PIN_LED_NETWORK, LOW);
    return false;
  }
}

// ==============================================================================
// 7. PUMP CONTROL, RELAY SOFT-SWITCHING & SAFETY INTERLOCKS
// ==============================================================================
// ==============================================================================
// 7. PUMP CONTROL, RELAY SOFT-SWITCHING & SAFETY INTERLOCKS (ZERO-LATENCY)
// ==============================================================================
void publishFastAckAndStatus(const char* cmdId, const char* reason);

void setPumpState(bool state, const String &reason) {
  if (state && emergencyStopped) {
    Serial.println("[Safety Interlock] Blocked: Emergency stop active! Reset emergency switch to run.");
    return;
  }
  // SAFETY INTERLOCK: In AUTO mode, if sub-node is not connected with main node, motor must NOT work!
  bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
  if (state && systemMode == "AUTO" && !subAlive) {
    Serial.println("[Safety Interlock] 🔒 BLOCKED: Sub-node (tank sensor) is disconnected! In AUTO mode the motor must not work.");
    return;
  }
  if (pumpRunning == state) return; // Prevent redundant relay cycling

  pumpRunning = state;

  // Instant hardware pin actuation (Microsecond response, zero blocking delays)
  digitalWrite(PIN_LED_PUMP, state ? HIGH : LOW);
  bool relayPinLevel = RELAY_ACTIVE_LOW ? (!state) : state;
  digitalWrite(PIN_RELAY_PUMP, relayPinLevel ? HIGH : LOW);

  if (state) {
    pumpStartTime = millis();
  }

  Serial.printf("[Pump Relay] Instant state switched to %s (Pin %d = %s). Reason: %s\n",
                state ? "ON" : "OFF", PIN_RELAY_PUMP, relayPinLevel ? "HIGH" : "LOW", reason.c_str());

  notifyMqttStatusUpdate = true;
}

// Immediate ACK & Live Status Dispatcher (Ultra-low latency sub-15ms roundtrip)
void publishFastAckAndStatus(const char* cmdId, const char* reason) {
  if (!mqttClient.connected()) return;

  // 1. Instant Command ACK
  StaticJsonDocument<256> ack;
  ack["commandId"] = (cmdId && strlen(cmdId) > 0) ? cmdId : "cmd_direct";
  ack["command"] = reason;
  ack["status"] = "SUCCESS";
  ack["pumpStatus"] = pumpRunning ? "ON" : "OFF";
  ack["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
  ack["mode"] = systemMode;
  ack["emergencyStopped"] = emergencyStopped;
  ack["timestamp"] = millis();
  String ackStr;
  serializeJson(ack, ackStr);
  mqttClient.publish("pump/command/ack", ackStr.c_str(), false);
  mqttClient.publish(("pump/" + deviceId + "/command/ack").c_str(), ackStr.c_str(), false);

  // 2. Instant Live Status Broadcast
  StaticJsonDocument<256> doc;
  doc["deviceId"] = deviceId;
  doc["nodeType"] = "MAIN_NODE";
  doc["status"] = "ONLINE";
  doc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
  doc["mode"] = systemMode;
  doc["emergencyStopped"] = emergencyStopped;
  bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
  doc["subNodeOnline"] = subAlive;
  doc["waterLevel"] = subAlive ? currentLevelPct : -1;
  doc["waterVolume"] = subAlive ? currentVolumeL : -1;
  doc["ip"] = WiFi.localIP().toString();
  doc["rssi"] = WiFi.RSSI();
  doc["timestamp"] = millis();
  String out;
  serializeJson(doc, out);
  mqttClient.publish("pump/status", out.c_str(), false);
  mqttClient.publish("pump/heartbeat", out.c_str(), false);
  mqttClient.publish(("pump/" + deviceId + "/status").c_str(), out.c_str(), true);
}

// ==============================================================================
// 8. FACTORY HARD RESET HANDLER (4-WAY TRIGGER)
// ==============================================================================
void executeFactoryReset() {
  Serial.println("\n*******************************************************");
  Serial.println("[FACTORY RESET] EXECUTING COMPLETE HARDWARE WIPE...");
  Serial.println("[FACTORY RESET] Erasing NVS Flash & SDK Wi-Fi Credentials...");
  Serial.println("*******************************************************\n");

  // Audible & visual confirmation (6 beeps and flashes)
  for (int i = 0; i < 6; i++) {
    digitalWrite(PIN_LED_NETWORK, HIGH);
    digitalWrite(PIN_LED_PUMP, HIGH);
    digitalWrite(PIN_BUZZER, HIGH);
    delay(70);
    digitalWrite(PIN_LED_NETWORK, LOW);
    digitalWrite(PIN_LED_PUMP, LOW);
    digitalWrite(PIN_BUZZER, LOW);
    delay(70);
  }

  // 1. Wipe our custom NVS namespace
  prefs.begin(NVS_NAMESPACE, false);
  prefs.clear();
  prefs.end();

  // 2. Erase ESP-IDF internal SDK Wi-Fi non-volatile flash storage
  WiFi.disconnect(true, true);
  WiFi.setAutoReconnect(false);

  storedSSID = "";
  storedPass = "";

  Serial.println("[FACTORY RESET] Wipe complete! Rebooting ESP32 into BLE Pairing Mode...\n");
  delay(400);
  ESP.restart();
}

// ==============================================================================
// 9. MQTT & BACKEND HTTP API CLIENT (SUB-10ms INSTANT ACTUATION)
// ==============================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message = "";
  for (unsigned int i = 0; i < length; i++) message += (char)payload[i];
  Serial.printf("[MQTT RX] Topic: '%s' | Payload: %s\n", topic, message.c_str());

