karthiknataraj547/Water-pump-controller/firmware/arduino_ide/ESP32_Main_Gateway/ESP32_Main_Gateway.ino
  // Fast Path 1: Plaintext commands (Zero serialization overhead)
  String cleanMsg = message;
  cleanMsg.trim();
  if (cleanMsg.equalsIgnoreCase("START") || cleanMsg.equalsIgnoreCase("ON") || cleanMsg.equalsIgnoreCase("START_PUMP")) {
    setPumpState(true, "MQTT Direct Plaintext Start");
    publishFastAckAndStatus("cmd_fast_raw", "MQTT Remote Start");
    hasPendingPumpCommand = false;
    return;
  } else if (cleanMsg.equalsIgnoreCase("STOP") || cleanMsg.equalsIgnoreCase("OFF") || cleanMsg.equalsIgnoreCase("STOP_PUMP")) {
    setPumpState(false, "MQTT Direct Plaintext Stop");
    publishFastAckAndStatus("cmd_fast_raw", "MQTT Remote Stop");
    hasPendingPumpCommand = false;
    return;
  }

  // Fast Path 2: JSON formatted payloads
  StaticJsonDocument<512> doc;
  if (deserializeJson(doc, message) == DeserializationError::Ok) {
    const char* action = doc["action"] | doc["command"] | "";
    const char* cmdId = doc["commandId"] | doc["command_id"] | "cmd_local";

    if (strlen(action) == 0 && doc.containsKey("parameters")) {
      action = doc["parameters"]["command"] | doc["parameters"]["action"] | "";
    }
    if (strlen(action) == 0 && doc.containsKey("pumpState")) {
      const char* ps = doc["pumpState"] | "";
      if (strcasecmp(ps, "ON") == 0 || strcasecmp(ps, "RUNNING") == 0) action = "START_PUMP";
      else if (strcasecmp(ps, "OFF") == 0 || strcasecmp(ps, "STOPPED") == 0) action = "STOP_PUMP";
    }

    Serial.printf("[MQTT Command RX] Action parsed: '%s' | CmdId: '%s'\n", action, cmdId);

    if (strcasecmp(action, "START_PUMP") == 0 || strcasecmp(action, "PUMP_ON") == 0 || strcasecmp(action, "START") == 0 || strcasecmp(action, "ON") == 0) {
      bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
      if (systemMode == "AUTO" && !subAlive) {
        Serial.println("[MQTT] 🔒 Start command rejected: Sub-node disconnected in AUTO mode.");
        notifyMqttStatusUpdate = true;
        return;
      }
      // Instant direct actuation - ZERO QUEUE DELAY
      setPumpState(true, "MQTT Fast Remote Start");
      publishFastAckAndStatus(cmdId, "MQTT Remote Start");
      hasPendingPumpCommand = false;
    } else if (strcasecmp(action, "STOP_PUMP") == 0 || strcasecmp(action, "PUMP_OFF") == 0 || strcasecmp(action, "STOP") == 0 || strcasecmp(action, "OFF") == 0) {
      // Instant direct actuation - ZERO QUEUE DELAY
      setPumpState(false, "MQTT Fast Remote Stop");
      publishFastAckAndStatus(cmdId, "MQTT Remote Stop");
      hasPendingPumpCommand = false;
    } else if (strcasecmp(action, "SET_MODE") == 0) {
      const char* m = doc["mode"] | doc["parameters"]["mode"] | "AUTO";
      systemMode = String(m);
      systemMode.toUpperCase();
      Serial.printf("[SYSTEM] Mode changed to: %s\n", systemMode.c_str());
      prefs.begin(NVS_NAMESPACE, false);
      prefs.putString("sys_mode", systemMode);
      prefs.end();
      publishFastAckAndStatus(cmdId, "Mode Switch");
    } else if (strcasecmp(action, "SET_RULES") == 0) {
      if (doc.containsKey("autoStartLevel")) autoStartLevel = doc["autoStartLevel"];
      if (doc.containsKey("autoStopLevel")) autoStopLevel = doc["autoStopLevel"];
      if (doc.containsKey("dryRunProtection")) dryRunProtectionEnabled = doc["dryRunProtection"];
      prefs.begin(NVS_NAMESPACE, false);
      prefs.putFloat("auto_start", autoStartLevel);
      prefs.putFloat("auto_stop", autoStopLevel);
      prefs.putBool("dry_run", dryRunProtectionEnabled);
      prefs.end();
      Serial.printf("[SYSTEM] Automation Rules Updated: Start at %.1f%%, Stop at %.1f%%\n", autoStartLevel, autoStopLevel);
      publishFastAckAndStatus(cmdId, "Rules Updated");
    } else if (strcasecmp(action, "TOGGLE_PUMP") == 0 || strcasecmp(action, "TOGGLE") == 0) {
      bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
      if (!pumpRunning && systemMode == "AUTO" && !subAlive) {
        Serial.println("[MQTT] 🔒 Toggle start rejected: Sub-node disconnected in AUTO mode.");
        notifyMqttStatusUpdate = true;
        return;
      }
      setPumpState(!pumpRunning, "MQTT Fast Toggle");
      publishFastAckAndStatus(cmdId, "MQTT Toggle");
      hasPendingPumpCommand = false;
    } else if (strcasecmp(action, "EMERGENCY_STOP") == 0) {
      emergencyStopped = true;
      setPumpState(false, "MQTT Fast Emergency Stop");
      publishFastAckAndStatus(cmdId, "MQTT Emergency Stop");
      hasPendingPumpCommand = false;
    } else if (strcasecmp(action, "CLEAR_EMERGENCY") == 0) {
      emergencyStopped = false;
      Serial.println("[Safety] Emergency Stop state cleared remotely via MQTT.");
      publishFastAckAndStatus(cmdId, "Clear Emergency");
    } else if (strcasecmp(action, "PING") == 0 || strstr(topic, "/ping") != NULL || strcmp(topic, "pump/ping") == 0) {
      StaticJsonDocument<384> pongDoc;
      pongDoc["ping_id"] = doc["ping_id"] | doc["pingId"] | "ping_req";
      pongDoc["deviceId"] = deviceId;
      pongDoc["device_id"] = deviceId;
      pongDoc["status"] = "ONLINE";
      pongDoc["state"] = "ONLINE";
      pongDoc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
      pongDoc["mode"] = systemMode;
      pongDoc["subNodeOnline"] = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
      pongDoc["uptime_ms"] = millis();
      pongDoc["client_timestamp_ms"] = doc["timestamp_ms"] | doc["timestamp"] | 0;
      pongDoc["free_heap"] = ESP.getFreeHeap();
      pongDoc["rssi"] = WiFi.RSSI();
      pongDoc["timestamp"] = millis() / 1000;
      String pongOut;
      serializeJson(pongDoc, pongOut);
      mqttClient.publish("pump/pong", pongOut.c_str(), false);
      mqttClient.publish(("pump/" + deviceId + "/pong").c_str(), pongOut.c_str(), false);
      notifyMqttStatusUpdate = true;
    } else if (strcasecmp(action, "GET_STATUS") == 0 || strcasecmp(action, "STATUS") == 0) {
      Serial.println("[MQTT] Immediate Status request received from App. Dispatching live state...");
      publishFastAckAndStatus(cmdId, "Immediate Status Report");
    } else if (strcasecmp(action, "FACTORY_RESET") == 0 || strcasecmp(action, "HARD_RESET") == 0 || strcasecmp(action, "RESET") == 0 || strcasecmp(action, "REMOVE") == 0) {
      Serial.println("[MQTT] Reset / Remove command received from Mobile App. Executing hardware wipe...");
      executeFactoryReset();
    }
  }
}

void sendHttpBackendTelemetry() {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  http.begin(storedBackendUrl);
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(600);

  StaticJsonDocument<384> doc;
  doc["deviceId"] = deviceId;
  doc["waterLevel"] = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS) ? currentLevelPct : -1;
  doc["waterVolume"] = currentVolumeL;
  doc["flowRate"] = currentFlowRateLpm;
  doc["temperature"] = currentTempC;
  doc["tds"] = currentTdsPpm;
  doc["battery"] = currentBatteryV;
  doc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
  doc["mode"] = systemMode;
  doc["rssi"] = WiFi.RSSI();

  String payload;
  serializeJson(doc, payload);

