karthiknataraj547/Water-pump-controller/firmware/arduino_ide/ESP32_Main_Gateway/ESP32_Main_Gateway.ino
      // 3. Dedicated Main Node Heartbeat & Live Telemetry (every 1.0 second)
      if (millis() - lastReport > STATUS_REPORT_INTERVAL) {
        lastReport = millis();
        StaticJsonDocument<384> doc;
        doc["deviceId"] = deviceId;
        doc["nodeType"] = "MAIN_NODE";
        doc["status"] = "ONLINE";
        doc["pumpState"] = pumpRunning ? "RUNNING" : "STOPPED";
        doc["mode"] = systemMode;
        doc["emergencyStopped"] = emergencyStopped;
        bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
        doc["subNodeOnline"] = subAlive;
        doc["waterLevel"] = subAlive ? currentLevelPct : -1;
        doc["waterVolume"] = subAlive ? currentVolumeL : -1;
        doc["flowRate"] = currentFlowRateLpm;
        doc["temperature"] = currentTempC;
        doc["tds"] = currentTdsPpm;
        doc["battery"] = currentBatteryV;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        doc["timestamp"] = millis();
        String out;
        serializeJson(doc, out);
        mqttClient.publish("pump/status", out.c_str(), false);
        mqttClient.publish("pump/heartbeat", out.c_str(), false);
        mqttClient.publish("pump/telemetry", out.c_str(), false);
        mqttClient.publish(("devices/" + deviceId + "/heartbeat").c_str(), out.c_str(), false);
        mqttClient.publish(("pump/" + deviceId + "/status").c_str(), out.c_str(), true);
        mqttClient.publish(("pump/" + deviceId + "/telemetry").c_str(), out.c_str(), false);
      }

      // 4. Cloud REST Telemetry Failover Sync (Runs only every 60s as backup when MQTT is active)
      static unsigned long lastHttpSync = 0;
      if (millis() - lastHttpSync > 60000) {
        lastHttpSync = millis();
        sendHttpBackendTelemetry();
      }
    }

    // High-responsiveness tick: 5ms loop ensures incoming MQTT command packets are read immediately
    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

// ==============================================================================
// 12. FREERTOS CORE 1: TASK CONTROL (Manual Button, Relay, Reset, Safety Engine)
// ==============================================================================
void TaskControl(void *pvParameters) {
  int bootBtnCounter = 0;
  int emergencyCounter = 0;
  int manualBtnCounter = 0;
  bool manualBtnLatched = false;

  for (;;) {
    // 0. Execute Pending Remote Pump Command from MQTT or App (Fallback queue)
    if (hasPendingPumpCommand) {
      hasPendingPumpCommand = false;
      setPumpState(requestedPumpState, pendingCmdReason);
    }
    // 1. Hard Reset Button Handler (BOOT / GPIO 0 - Hold 1.5s with bounce immunity)
    if (digitalRead(PIN_HARD_RESET) == LOW) {
      bootBtnCounter++;
      if (bootBtnCounter == 1) {
        Serial.println("[RESET BTN] BOOT button pressed. Hold for 1.5s to Factory Reset...");
      } else if (bootBtnCounter % 30 == 0) {
        Serial.printf("[RESET BTN] Holding BOOT button... (%d ms / 1500 ms)\n", bootBtnCounter * 10);
      }
      if (bootBtnCounter >= 150) { // 150 * 10ms = 1500ms
        executeFactoryReset();
      }
    } else {
      if (bootBtnCounter > 0) bootBtnCounter -= 2; // Smooth decay prevents contact bounce resets
      if (bootBtnCounter < 0) bootBtnCounter = 0;
    }

    // 2. Serial Monitor Reset Command Listener
    if (Serial.available()) {
      String cmd = Serial.readStringUntil('\n');
      cmd.trim();
      if (cmd.equalsIgnoreCase("reset") || cmd.equalsIgnoreCase("factory")) {
        executeFactoryReset();
      } else if (cmd.equalsIgnoreCase("pump on") || cmd.equalsIgnoreCase("on")) {
        setPumpState(true, "Serial Command");
      } else if (cmd.equalsIgnoreCase("pump off") || cmd.equalsIgnoreCase("off")) {
        setPumpState(false, "Serial Command");
      } else if (cmd.equalsIgnoreCase("auto")) {
        systemMode = "AUTO";
        Serial.println("[SYSTEM] Mode changed to AUTO");
      } else if (cmd.equalsIgnoreCase("manual")) {
        systemMode = "MANUAL";
        Serial.println("[SYSTEM] Mode changed to MANUAL");
      }
    }

    // 3. Hardware Emergency Stop Switch (Requires sustained 150ms LOW to prevent false trips from inductive relay noise)
    if (digitalRead(PIN_EMERGENCY_STOP) == LOW) {
      emergencyCounter++;
      if (emergencyCounter >= 15) { // 15 * 10ms = 150ms continuous LOW
        if (!emergencyStopped) {
          emergencyStopped = true;
          setPumpState(false, "Hardware Emergency Button Pressed");
        }
      }
    } else {
      emergencyCounter = 0;
    }

    // 4. Manual Switching Push Button (Debounced toggle - requires sustained 60ms press)
    if (digitalRead(PIN_MANUAL_BUTTON) == LOW) {
      manualBtnCounter++;
      if (manualBtnCounter >= 6 && !manualBtnLatched) {
        manualBtnLatched = true;
        setPumpState(!pumpRunning, "Manual Physical Toggle Button");
      }
    } else {
      manualBtnCounter = 0;
      manualBtnLatched = false;
    }

    // 5. Autonomous Automation & Safety Engine
    bool subAlive = (lastSensorPacketTime > 0 && (millis() - lastSensorPacketTime) < SUB_NODE_TIMEOUT_MS);
    if (systemMode == "AUTO") {
      if (!subAlive) {
        // SAFETY INTERLOCK: In AUTO mode, if sub-node is not connected with main node, motor must NOT work!
        if (pumpRunning) {
          setPumpState(false, "Sub-Node Disconnected Safety Cutoff (Auto Mode Locked)");
        }
      } else if (currentLevelPct >= 0.0f) {
        // High Level Cutoff
        if (pumpRunning && currentLevelPct >= autoStopLevel) {
          setPumpState(false, "Tank High Level Cutoff (" + String(currentLevelPct, 1) + "%)");
        }
        // Low Level Auto Refill
        if (!pumpRunning && currentLevelPct <= autoStartLevel && !emergencyStopped) {
          setPumpState(true, "Tank Low Level Auto Refill (" + String(currentLevelPct, 1) + "%)");
        }
      }
    }

    // 6. Max Continuous Runtime Safety Cutoff (30 minutes)
    if (pumpRunning && (millis() - pumpStartTime > MAX_RUN_TIME_LIMIT_MS)) {
      setPumpState(false, "Continuous Max Run Time Limit Reached (30 Mins)");
    }

    // Crisp 10ms control cycle
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

// ==============================================================================
// 13. SYSTEM INITIALIZATION & MAIN SETUP
// ==============================================================================
void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Disable brownout detector to prevent reboot on power sag

