karthiknataraj547/Water-pump-controller/firmware/arduino_ide/ESP32_Main_Gateway/ESP32_Main_Gateway.ino
  Serial.begin(115200);
  delay(500);
  Serial.println("\n=======================================================");
  Serial.println("   HydroPulse ESP32 Gateway Node Booting (v2.0.0)");
  Serial.println("=======================================================");

  // Pin Configurations
  pinMode(PIN_RELAY_PUMP, OUTPUT);
  pinMode(PIN_LED_NETWORK, OUTPUT);
  pinMode(PIN_LED_PUMP, OUTPUT);
  pinMode(PIN_BUZZER, OUTPUT);
  pinMode(PIN_EMERGENCY_STOP, INPUT_PULLUP);
  pinMode(PIN_MANUAL_BUTTON, INPUT_PULLUP);
  pinMode(PIN_HARD_RESET, INPUT_PULLUP);

  // Initialize all outputs to safe OFF state
  digitalWrite(PIN_RELAY_PUMP, RELAY_ACTIVE_LOW ? HIGH : LOW);
  digitalWrite(PIN_LED_PUMP, LOW);
  digitalWrite(PIN_BUZZER, LOW);

  // Diagnostic: Print hardware reset reason
  esp_reset_reason_t rst_reason = esp_reset_reason();
  const char* rst_str = "NORMAL BOOT";
  switch (rst_reason) {
    case ESP_RST_POWERON:   rst_str = "POWER ON (Cold Boot)"; break;
    case ESP_RST_SW:        rst_str = "SOFTWARE RESTART"; break;
    case ESP_RST_PANIC:     rst_str = "EXCEPTION / CRASH"; break;
    case ESP_RST_BROWNOUT:  rst_str = "BROWNOUT (Voltage dipped below 2.5V from motor surge!)"; break;
    default: break;
  }
  Serial.printf("[SYSTEM] Reset Reason: %s (Code: %d)\n", rst_str, rst_reason);

  // Load Saved Configuration from NVS
  prefs.begin(NVS_NAMESPACE, false);
  systemMode = prefs.getString("sys_mode", "AUTO");
  autoStartLevel = prefs.getFloat("auto_start", 25.0f);
  autoStopLevel = prefs.getFloat("auto_stop", 95.0f);
  dryRunProtectionEnabled = prefs.getBool("dry_run", true);
  prefs.end();

  Serial.printf("[SYSTEM] Mode: %s | Auto-Start: %.0f%% | Auto-Stop: %.0f%%\n",
                systemMode.c_str(), autoStartLevel, autoStopLevel);

  // Instant Power-On Reset Check (Hold BOOT button at power-on for 1.2s)
  if (digitalRead(PIN_HARD_RESET) == LOW) {
    Serial.println("[BOOT] BOOT button pressed at power-on! Hold 1.2s for Factory Reset...");
    unsigned long bootPressStart = millis();
    while (digitalRead(PIN_HARD_RESET) == LOW) {
      delay(40);
      if (millis() - bootPressStart >= 1200) {
        executeFactoryReset();
      }
    }
    Serial.println("[BOOT] BOOT button released. Proceeding with standard boot.");
  }

  // 1. Wi-Fi & ESP-NOW Setup
  WiFi.mode(WIFI_AP_STA);
  WiFi.setSleep(false); // Disable modem sleep to prevent radio drops
  esp_wifi_set_ps(WIFI_PS_NONE);

  // Generate Unique Device ID from True Hardware eFuse MAC Address
  uint8_t mac[6] = {0};
  WiFi.macAddress(mac);
  if (mac[3] == 0 && mac[4] == 0 && mac[5] == 0) {
    uint64_t chipMac = ESP.getEfuseMac();
    uint8_t* efuseBytes = (uint8_t*)(&chipMac);
    for (int i = 0; i < 6; i++) mac[i] = efuseBytes[i];
  }
  char devIdBuf[32];
  snprintf(devIdBuf, sizeof(devIdBuf), "%s%02X%02X%02X", DEFAULT_DEVICE_PREFIX, mac[3], mac[4], mac[5]);
  deviceId = String(devIdBuf);

  Serial.printf("[SYSTEM] Device ID: %s | Hardware MAC: %02X:%02X:%02X:%02X:%02X:%02X\n",
                deviceId.c_str(), mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  if (esp_now_init() == ESP_OK) {
    Serial.println("[ESP-NOW] Subsystem initialized successfully!");
    esp_now_register_recv_cb(onEspNowDataRecv);

    // Register Broadcast Peer for ESP8266 Sub Node
    esp_now_peer_info_t peerInfo = {};
    memset(&peerInfo, 0, sizeof(peerInfo));
    for (int i = 0; i < 6; i++) peerInfo.peer_addr[i] = 0xFF;
    peerInfo.channel = 0; // Receive on any channel
    peerInfo.encrypt = false;
    if (esp_now_add_peer(&peerInfo) == ESP_OK) {
      Serial.println("[ESP-NOW] Broadcast peer registered (Listening for ESP8266 Sub Nodes).");
    }
  } else {
    Serial.println("[ESP-NOW] ERROR: Init Failed!");
  }

  Serial.printf("[WiFi] Initial Radio Channel: %d\n", WiFi.channel());

  // 2. Read Stored Wi-Fi from Flash NVS
  prefs.begin(NVS_NAMESPACE, false);
  storedSSID = prefs.getString("wifi_ssid", "");
  storedPass = prefs.getString("wifi_pass", "");
  prefs.end();

  bool wifiAutoConnected = false;
  if (storedSSID.length() > 0) {
    Serial.printf("[NVS] Found saved Wi-Fi: '%s'. Auto-connecting...\n", storedSSID.c_str());
    wifiAutoConnected = connectWifi(storedSSID, storedPass);
    Serial.printf("[WiFi] Post-Connect Radio Channel: %d\n", WiFi.channel());
  }

  // 3. Start BLE Provisioning only if Wi-Fi is not connected
  if (!wifiAutoConnected) {
    Serial.println("[BLE] Wi-Fi not connected. Starting BLE Provisioning server for app pairing...");
    startBleProvisioning();
  } else {
    Serial.println("[BLE] Saved Wi-Fi connected directly. BLE Provisioning bypassed.");
  }

  // 4. MQTT Client Setup
  mqttClient.setServer(DEFAULT_MQTT_BROKER, DEFAULT_MQTT_PORT);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(1024);
  mqttClient.setKeepAlive(30);

  // 5. Spawn FreeRTOS Dual-Core Tasks
  xTaskCreatePinnedToCore(TaskNetwork, "NetTask", 8192, NULL, 1, &TaskNetworkHandle, 0); // Core 0
  xTaskCreatePinnedToCore(TaskControl, "CtrlTask", 8192, NULL, 2, &TaskControlHandle, 1); // Core 1

  Serial.println("=======================================================");
  Serial.println(">> SYSTEM READY!");
  Serial.println(">> PUMP RELAY: GPIO 23 | MANUAL BUTTON: GPIO 19 | EMERGENCY: GPIO 18");
  Serial.println(">> FACTORY RESET: Hold BOOT (GPIO 0) for 1.5s or type 'reset' in Serial.");
  Serial.println("=======================================================\n");
}

void loop() {
  vTaskDelay(pdMS_TO_TICKS(1000));
}
